<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <link rel="shortcut icon" href="<?php echo get_template_directory_uri(); ?>/img/favicon.png">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta name="theme-color" content="#1f1f1f">
  <meta name="description" content="Рады видеть Вас на своём сайте.">
  <meta property="og:title" content="Миграционные услуги в Москве и Московской области.">
  <meta property="og:type" content="website">
  <meta property="og:url" content="http://сайт.ru/">
  <meta property="og:image" content="https://main/img/propertyOgImage.jpg">
  <meta name="keywords" content="оформление, статус, внж, рвп, рф, услуги">
  <title>МиграПро</title>
  <?php wp_head(); ?>
</head>
<body>
    <div class="wrapper">
      <h1 class="visually-hidden">Я для семантики</h1>
      <header class="header">
        <div class="header__container">
          <div class="header__box-shadow">
            <div class="header__top">
              <a class="header__logo" href="#">
                <img class="logo" src="<?php echo get_template_directory_uri(); ?>/img/logo.png" alt="логотип МиграПро">
              </a>
              <nav class="header__social social">
                <ul class="social__list">
                  <li class="social__item">
                    <a class="social__link" href="https://www.whatsapp.com/" target="blank">
                      <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12.0273 0H11.9727C5.36035 0 0 5.36035 0 11.9727V12.0273C0 18.6397 5.36035 24 11.9727 24H12.0273C18.6397 24 24 18.6397 24 12.0273V11.9727C24 5.36035 18.6397 0 12.0273 0Z" fill="#40CD4A"/>
                        <path d="M14.3387 15.5101C11.2671 15.5101 8.76816 13.0103 8.76732 9.93868C8.76816 9.16007 9.40215 8.52692 10.1791 8.52692C10.259 8.52692 10.338 8.53364 10.4137 8.5471C10.5802 8.57484 10.7382 8.63118 10.8837 8.7161C10.9047 8.72872 10.919 8.7489 10.9224 8.77244L11.2469 10.8182C11.2511 10.8426 11.2436 10.8661 11.2276 10.8838C11.0485 11.0822 10.8198 11.2252 10.565 11.2966L10.4423 11.3311L10.4885 11.4497C10.9072 12.5158 11.7599 13.3676 12.8269 13.788L12.9454 13.8351L12.9799 13.7124C13.0514 13.4576 13.1943 13.2289 13.3928 13.0498C13.4071 13.0363 13.4264 13.0296 13.4457 13.0296C13.4499 13.0296 13.4541 13.0296 13.4592 13.0304L15.5049 13.355C15.5293 13.3592 15.5495 13.3727 15.5621 13.3937C15.6462 13.5391 15.7025 13.6981 15.7311 13.8645C15.7446 13.9385 15.7505 14.0167 15.7505 14.0983C15.7505 14.8761 15.1173 15.5092 14.3387 15.5101Z" fill="#FDFDFD"/>
                        <path d="M19.7858 11.3261C19.6202 9.45435 18.7625 7.71803 17.3709 6.43743C15.9709 5.14927 14.1547 4.43961 12.2553 4.43961C8.0864 4.43961 4.69447 7.83154 4.69447 12.0004C4.69447 13.3996 5.0804 14.7626 5.81109 15.9498L4.18155 19.557L9.39894 19.0012C10.3062 19.3729 11.2664 19.5612 12.2544 19.5612C12.5142 19.5612 12.7808 19.5478 13.0482 19.52C13.2836 19.4948 13.5216 19.4578 13.7553 19.4107C17.2465 18.7052 19.795 15.6068 19.8152 12.0408V12.0004C19.8152 11.7734 19.8051 11.5464 19.785 11.3261H19.7858ZM9.59991 17.4179L6.71332 17.7257L7.57517 15.8161L7.4028 15.5849C7.39019 15.5681 7.37758 15.5513 7.36328 15.5319C6.61494 14.4985 6.21974 13.2776 6.21974 12.0012C6.21974 8.67322 8.92723 5.96572 12.2553 5.96572C15.3731 5.96572 18.0158 8.39826 18.2706 11.5035C18.2841 11.67 18.2916 11.8373 18.2916 12.0021C18.2916 12.0492 18.2908 12.0954 18.2899 12.145C18.226 14.929 16.2812 17.2935 13.5602 17.8955C13.3526 17.9418 13.1398 17.9771 12.9279 17.9998C12.7076 18.025 12.4815 18.0376 12.2569 18.0376C11.4573 18.0376 10.6804 17.8829 9.94633 17.5768C9.86477 17.544 9.78488 17.5087 9.71005 17.4726L9.60075 17.4196L9.59991 17.4179Z" fill="#FDFDFD"/>
                      </svg>                    
                    </a>
                  </li>
                  <li class="social__item">
                    <a class="social__link" href="https://telegram.org/" target="blank">
                      <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12.0273 0H11.9727C5.36034 0 0 5.36035 0 11.9727V12.0273C0 18.6397 5.36034 24 11.9727 24H12.0273C18.6397 24 24 18.6397 24 12.0273V11.9727C24 5.36035 18.6397 0 12.0273 0Z" fill="#00B0F2"/>
                        <path d="M4.54537 11.591C4.57901 11.5741 4.61266 11.5582 4.64545 11.543C5.21554 11.279 5.79319 11.0318 6.37 10.7846C6.40112 10.7846 6.45323 10.7484 6.48266 10.7367C6.52723 10.7173 6.5718 10.6988 6.61636 10.6795L6.87282 10.5693C7.04435 10.4962 7.21503 10.423 7.38656 10.3499C7.72878 10.2036 8.071 10.0573 8.41322 9.91013C9.09766 9.61752 9.78296 9.32407 10.4674 9.03146C11.1518 8.73884 11.8371 8.44539 12.5216 8.15278C13.206 7.86017 13.8913 7.56672 14.5757 7.27411C15.2602 6.9815 15.9455 6.68804 16.6299 6.39543C16.7821 6.32985 16.9469 6.23231 17.11 6.20372C17.2471 6.17934 17.3807 6.13225 17.5186 6.10619C17.7801 6.05658 18.0686 6.0364 18.3191 6.14486C18.4057 6.1827 18.4856 6.23567 18.552 6.3021C18.8699 6.61657 18.8253 7.13285 18.758 7.57513C18.2897 10.6576 17.8213 13.741 17.3522 16.8235C17.2883 17.2464 17.2008 17.7106 16.867 17.978C16.5845 18.2041 16.1826 18.2294 15.8336 18.1335C15.4847 18.0368 15.1769 17.8342 14.8751 17.6349C13.6231 16.8058 12.3702 15.9768 11.1182 15.1477C10.8206 14.9509 10.4893 14.6936 10.4926 14.3363C10.4943 14.121 10.6229 13.9293 10.7541 13.7586C11.8422 12.3393 13.412 11.3639 14.5799 10.0102C14.7447 9.81932 14.8742 9.47458 14.648 9.36443C14.5135 9.29884 14.3588 9.38797 14.236 9.4729C12.6922 10.545 11.1493 11.6179 9.60554 12.6899C9.10188 13.0397 8.57384 13.3996 7.96675 13.4854C7.42357 13.5627 6.87703 13.4114 6.35151 13.2567C5.91091 13.1272 5.47114 12.9943 5.03306 12.8573C4.80015 12.785 4.55967 12.7068 4.37973 12.5428C4.19979 12.3788 4.09638 12.103 4.20485 11.8844C4.27296 11.7474 4.40497 11.6608 4.54371 11.5901L4.54537 11.591Z" fill="#FEFFFC"/>
                      </svg>                    
                    </a>
                  </li>
                </ul>
              </nav>
              <div class="header__info">
                <a class="header__phone" href="tel:84958590051">+7 (495) 859-00-51</a>
                <p class="header__schedule desc">Пн–Пт: 09:00–18:00</p>
              </div>
              <!-- <a class="header__phoneBtn btn" href="tel:84958590051">Бесплатная консультация</a> -->
              <a class="header__phoneBtn btn" href="tel:84958590051">
                <span class="text">Бесплатная консультация</span>
                <span class="mobile">
                  <svg width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M21.8591 17.4434L16.7778 12.8234C16.5377 12.605 16.2221 12.4886 15.8976 12.4986C15.5732 12.5086 15.2653 12.6444 15.0391 12.8771L12.0478 15.9534C11.3278 15.8159 9.8803 15.3646 8.39035 13.8784C6.90035 12.3871 6.4491 10.9359 6.31535 10.2209L9.38905 7.22838C9.62218 7.00228 9.75805 6.6944 9.76805 6.36988C9.77805 6.04536 9.66143 5.72968 9.4428 5.48961L4.8241 0.409614C4.6054 0.168814 4.30145 0.022751 3.97679 0.00243854C3.65213 -0.0178615 3.33235 0.0891888 3.08535 0.300864L0.372852 2.62711C0.15674 2.84401 0.0277525 3.13269 0.0103525 3.43836C-0.00839755 3.75086 -0.365897 11.1534 5.3741 16.8959C10.3816 21.9021 16.6541 22.2684 18.3816 22.2684C18.6341 22.2684 18.7891 22.2609 18.8303 22.2584C19.1361 22.2413 19.4246 22.1118 19.6403 21.8946L21.9653 19.1809C22.1779 18.9346 22.2857 18.6151 22.2658 18.2905C22.2461 17.9659 22.1001 17.6619 21.8591 17.4434Z" fill="#EAF1F6"/>
                  </svg>
                </span>
              </a>
              <button id="burger" class="burger">
                <span></span>
                <span></span>
                <span></span>
              </button>
            </div>
            <div class="header__bottom">              
              <nav class="header__nav menu" id="menu">
                <?php
                  wp_nav_menu( array(
                    'theme_location' => 'primary',
                    'menu_class'     => 'header__list header__list_js',
                    'container'      => false,
                    'fallback_cb'    => false,
                    'walker'         => new Custom_Walker_Nav_Menu(), // ← добавляем кастомный Walker. <p class="header__dropdown-desc desc">
                  ) );
                ?>
              </nav>
              <div class="header__arrowText">
                <div class="header__stars">
                  <img src="<?php echo get_template_directory_uri(); ?>/img/star.svg" alt="Рейтинг МиграПро">
                  <img src="<?php echo get_template_directory_uri(); ?>/img/star.svg" alt="">
                  <img src="<?php echo get_template_directory_uri(); ?>/img/star.svg" alt="">
                  <img src="<?php echo get_template_directory_uri(); ?>/img/star.svg" alt="">
                  <img src="<?php echo get_template_directory_uri(); ?>/img/star.svg" alt="">
                </div>
                <p class="header__desc desc">4,8 на Яндекс.Картах и 2ГИС</p>
              </div>
            </div>
          </div>
        </div>
      </header>
      <main>